elastic-tube-1d/OpenFOAM-CalculiX/Fluid/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    auto0
    {
        type            uniformFixedValue;
	uniformValue	table
	(
	(0 1.3332)
	(3e-3 1.3332)
	(3.1e-3 0)
	(1e-2 0)
	);
    }
    interface
    {
        type            zeroGradient;
    }
    auto2
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
